## 26-05-2025

In [1]:
# Detect and Handle Missing Values

import pandas as pd
import numpy as np

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', np.nan, 'David'],
    'Age': [25, np.nan, 30, 22],
    'Salary': [50000, 60000, 52000, np.nan]
})
df

    Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob   NaN  60000.0
2    NaN  30.0  52000.0
3  David  22.0      NaN

In [2]:
df.isnull().sum()

Name      1
Age       1
Salary    1
dtype: int64

In [3]:
df['Name'].fillna('unknown',inplace=True)

C:\Users\91805\AppData\Local\Temp\ipykernel_6372\3029376215.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Name'].fillna('unknown',inplace=True)

In [4]:
df.isnull().sum()

Name      0
Age       1
Salary    1
dtype: int64

In [5]:
df['Age'].fillna(df['Age'].mean(),inplace=True)

C:\Users\91805\AppData\Local\Temp\ipykernel_6372\694922604.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace=True)

In [6]:
df.isnull().sum()

Name      0
Age       0
Salary    1
dtype: int64

In [7]:
df['Salary'].fillna(df['Salary'].mean(),inplace=True)

C:\Users\91805\AppData\Local\Temp\ipykernel_6372\2738737218.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(),inplace=True)

In [8]:
df

      Name        Age   Salary
0    Alice  25.000000  50000.0
1      Bob  25.666667  60000.0
2  unknown  30.000000  52000.0
3    David  22.000000  54000.0

In [9]:
# Grouping and Aggregation
import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Department': ['HR', 'IT', 'IT', 'Finance', 'HR'],
    'Salary': [50000, 70000, 60000, 65000, 48000]
})
df

      Name Department  Salary
0    Alice         HR   50000
1      Bob         IT   70000
2  Charlie         IT   60000
3    David    Finance   65000
4      Eva         HR   48000

In [10]:
avg_salary=df.groupby('Department')['Salary'].mean().reset_index()

In [11]:
avg_salary

  Department   Salary
0    Finance  65000.0
1         HR  49000.0
2         IT  65000.0

In [12]:
# Identify Top N Entries

import pandas as pd
df = pd.DataFrame({
    'Product': ['A', 'B', 'C', 'D'],
    'Revenue': [2000, 4500, 1500, 3800]
})
df

  Product  Revenue
0       A     2000
1       B     4500
2       C     1500
3       D     3800

In [13]:
top_products=df.sort_values(by='Revenue',ascending=False)
top_products

  Product  Revenue
1       B     4500
3       D     3800
0       A     2000
2       C     1500

In [14]:
#  Find Outliers Using IQR

import pandas as pd

df = pd.DataFrame({
    'Product': ['A', 'B', 'C', 'D'],
    'Revenue': [2000, 4500, 1500, 3800]
})
df

  Product  Revenue
0       A     2000
1       B     4500
2       C     1500
3       D     3800

In [15]:
Q1=df['Revenue'].quantile(0.25)
Q1

1875.0

In [16]:
Q3=df['Revenue'].quantile(0.75)
Q3

3975.0

In [17]:
IQR=Q3-Q1
IQR

2100.0

In [18]:
lower=Q1-1.5*IQR
lower

-1275.0

In [19]:
upper=Q3+1.5*IQR
upper

7125.0

In [21]:
outlier=df[(df['Revenue']<lower) | (df['Revenue']>upper)]
outlier

Empty DataFrame
Columns: [Product, Revenue]
Index: []